# Створення та Маніпуляція Графом
import networkx as nx
import matplotlib.pyplot as plt

# Створення графа
# Створюємо порожній неорієнтований граф
G = nx.Graph()

# Додавання вузлів
# Додаємо один вузол
G.add_node("Анна")

# Додаємо декілька вузлів зі списку
G.add_nodes_from(["Борис", "Віктор", "Дарина"])
print(f"Додано вузли: {G.nodes()}")

# Додавання ребер
# Додаємо одне ребро (дружбу)
G.add_edge("Анна", "Борис")

# Додаємо декілька ребер зі списку
G.add_edges_from([("Анна", "Віктор"), ("Борис", "Віктор"), ("Борис", "Дарина")])
G.add_edge("Анна", "Василь")  # якщо вузлів не було, то вони створяться автоматично
print(f"Додано ребра: {G.edges()}")  #

# Базове дослідження графа
print("\n--- Дослідження графа ---")
print(f"Загальна кількість вузлів: {G.number_of_nodes()}")
print(f"Загальна кількість ребер: {G.number_of_edges()}")

# Сусіди - це вузли, з'єднані з "Анною"
print(f"Друзі (сусіди) Анни: {list(G.neighbors('Анна'))}")

print("\nМалюємо граф...")
nx.draw(
    G,
    with_labels=True,  # Показувати імена
    node_color="skyblue",  # Колір вузлів
    node_size=1500,  # Розмір вузлів
    font_weight="bold",  # Жирний шрифт
    width=2,  # Товщина ребер
)
plt.show()

# Видалення елементів
print("\n--- Видалення елементів ---")
# Дарина поїхала і видалила свій профіль
G.remove_node("Дарина")

print(f"Вузли після видалення Дарини: {G.nodes()}")
print(f"Ребра після видалення Дарини: {G.edges()}")
# Зверніть увагу: ребро ("Борис", "Дарина") видалилось автоматично!

print("\nМалюємо фінальний граф...")
nx.draw(
    G,
    with_labels=True,  # Показувати імена
    node_color="skyblue",  # Колір вузлів
    node_size=1500,  # Розмір вузлів
    font_weight="bold",  # Жирний шрифт
    width=2,  # Товщина ребер
)
plt.show()
